RongHQ/contiki-sensinode/platform/cc2530dk/dev/leds-arch.c
/*
 * Copyright (c) 2011, George Oikonomou - <oikonomou@users.sourceforge.net>
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the Institute nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * This file is part of the Contiki operating system.
 */

/**
 * \file
 *         Platform-specific led driver for the TI SmartRF05 Eval. Board.
 *
 * \author
 *         George Oikonomou - <oikonomou@users.sourceforge.net>
 */
#include "contiki-conf.h"
#include "dev/leds.h"
#include "dev/leds-arch.h"
#include "cc253x.h"

/*
 * LEDS
 *  1: P1_0
 *  2: P2_0
 *  3: P1_1
 *  4: P0_1 (LED4 shares port/pin with B1 and is currently unused)
 */

/* H/W Connections */
#define LED1_PIN P1_0
#define LED2_PIN P2_0
#define LED3_PIN P1_1

/* P0DIR and P0SEL masks */
#define LED1_MASK  0x01
#define LED2_MASK  0x02
#define LED3_MASK  0x01
#define LED4_MASK  0x02
/*---------------------------------------------------------------------------*/
void
leds_arch_init(void)
{
	 P1SEL &= ~(LED1_MASK | LED2_MASK);
	 P1DIR |= (LED1_MASK | LED2_MASK );
	 P2SEL &= ~(LED3_MASK);
	 P2DIR |= (LED3_MASK);
}
/*---------------------------------------------------------------------------*/
unsigned char
leds_arch_get(void)
{
  unsigned char v;

  v = (unsigned char) (LED1_PIN | (LED2_PIN << 1) | (LED3_PIN << 2));

  return v;
}
/*---------------------------------------------------------------------------*/
void
leds_arch_set(unsigned char leds)
{
	char temp;
	  temp = (leds & 0x01)^ 0x01;
	  LED1_PIN = temp;
	#if MODEL_CC2531
	  LED2_PIN = ((leds & 0x02) >> 1) ^ 0x01;
	#else
	  temp = ((leds & 0x02) >> 1)^ 0x01;
	  LED2_PIN = temp;
	  temp = ((leds & 0x04) >> 2)^ 0x01;
	  LED3_PIN = temp;
	#endif
}
/*---------------------------------------------------------------------------*/
